uhnp/src/InformationRegisters/АналитикаПланированияСтруктуры/АналитикаПланированияСтруктуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаПланированияСтруктуры</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/КлючиАналитикиПланированияСтруктуры/КлючиАналитикиПланированияСтруктуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиАналитикиПланированияСтруктуры</name>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <comment>(-УХПредставлениеСписка)(-УХПредставлениеОбъекта)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПроектЭтапа</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнаяВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалютаПлатежей</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьБазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_СметнаяСтоимостьТекущая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделИнвестиционнойПрограммы</name>
    <type>
      <types>CatalogRef.РазделыИнвестиционныхПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОцениваетсяПоКритериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРасчетаАнализаKPI</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельРасчетаПоказателейПроекта</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОтображенияМоделиРасчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПроектыПредшественники</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/АналитикаПланированияСтруктуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает информацию о ключе
Функция ИнформацияОКлюче() Экспорт

	//
	Результат = Новый Структура;
	Результат.Вставить("СправочникИмя", "КлючиАналитикиПланированияСтруктуры");
	Результат.Вставить("СправочникМенеджер", Справочники.КлючиАналитикиПланированияСтруктуры);
	Результат.Вставить("СправочникМетаданные", Метаданные.Справочники.КлючиАналитикиПланированияСтруктуры);
	Результат.Вставить("РегистрИмя", "АналитикаПланированияСтруктуры");
	Результат.Вставить("РегистрМенеджер", РегистрыСведений.АналитикаПланированияСтруктуры);
	Результат.Вставить("РегистрМетаданные", Метаданные.РегистрыСведений.АналитикаПланированияСтруктуры);
	
	Результат.Вставить("ИмяПоляАналитика", "АналитикаПланированияСтруктуры");
	
	КонтрольУХКлючи.ДобавитьИзмеренияКлюча(Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПолноеНаименованиеКлючаАналитики(МенеджерЗаписи) Экспорт
	
	Поля = Новый Массив;
	Поля.Добавить(СокрЛП(МенеджерЗаписи.ЦФО));
	Если ЗначениеЗаполнено(МенеджерЗаписи.Проект) Тогда
		Поля.Добавить(СокрЛП(МенеджерЗаписи.Проект));
	КонецЕсли;
	Если ЗначениеЗаполнено(МенеджерЗаписи.Организация) Тогда
		Поля.Добавить(СокрЛП(МенеджерЗаписи.Организация));
	КонецЕсли;
	
	Возврат СтрСоединить(Поля, "; ");
	
КонецФункции

// Функция получает элемент справочника - ключ аналитики планирования структуры.
//
// Параметры:
//	ПараметрыАналитики - Выборка, Структура - Содержит полями "ЦФО, Проект, Организация":
//		* ЦФО - СправочникСсылка.Организации.
//		* Проект - СправочникСсылка.Проекты.
//		* Организация - СправочникСсылка.Организации.
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиАналитикиПланированияСтруктуры - Созданный элемент справочника.
//
Функция ЗначениеКлючаАналитики(ПараметрыАналитики) Экспорт

	ИнформацияОКлюче = ИнформацияОКлюче();
	НаборЗаписей = ПолучитьНаборЗаписей(ПараметрыАналитики);
	
	Если НаборЗаписей <> Неопределено Тогда
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0
			И Не ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;

		Если НаборЗаписей.Количество() > 0
			И ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			Результат = НаборЗаписей[0].КлючАналитики;
		Иначе
			Результат = СоздатьКлючАналитики(ПараметрыАналитики,, ИнформацияОКлюче);
		КонецЕсли;

		Возврат Результат;
	КонецЕсли;

КонецФункции

// Функция получает элемент справочника - ключ аналитики планирования.
//
// Параметры:
//	ПараметрыАналитики - Выборка или Структура  с полями "ЦФО, Проект, Организация".
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиАналитикиПланированияСтруктуры - Созданный элемент справочника.
//
Функция СоздатьКлючАналитики(ПараметрыАналитики, ЗаписьПриОбновленииИБ = Ложь, ИнформацияОКлюче = неопределено) Экспорт
	
	Если ИнформацияОКлюче = неопределено Тогда
		ИнформацияОКлюче = ИнформацияОКлюче();
	КонецЕсли;
	
	Возврат КонтрольУХКлючи.СоздатьКлючАналитики(ИнформацияОКлюче, ПараметрыАналитики);
	
КонецФункции

// Заполняет поле АналитикаПланированияСтруктуры в коллекции, содержащей статью бюджета, аналитику1-3, Направление.
//
// Параметры:
//
//	Коллекция - ТабличнаяЧасть - Коллекция, в которой производится заполнение аналитики планирования структуры.
//
//	ИменаПолей - Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля берется из имени ключа.
//		секция идентификации {ЦФО, Проект, Организация, АналитикаПланированияСтруктуры},
//	
//	ПараметрыЗаполнения - Структура - см. метод КонтрольУХКлючи.ПараметрыЗаполненияКлючейАналитики()
//
// Пример 1:
//	ИменаПолей = РегистрыСведений.АналитикаПланированияСтруктуры.ИменаПолейКоллекцииПоУмолчанию();
//	РегистрыСведений.АналитикаПланированияСтруктуры.ЗаполнитьВКоллекции(ДвиженияОперации, ИменаПолей);
//
// Пример 2:
//	РегистрыСведений.АналитикаПланированияСтруктуры.ЗаполнитьВКоллекции(ДвиженияОперации);
//
Процедура ЗаполнитьВКоллекции(Коллекция, 
								ИменаПолей = Неопределено, ДополнитьКлюч = Ложь, ПараметрыЗаполнения = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = КонтрольУХКлючи.ПараметрыЗаполненияКлючейАналитики();
	КонецЕсли;
	
	Если ДополнитьКлюч Тогда
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейДополненияКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
	Иначе
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
		
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.АналитикаПланированияСтруктуры) Тогда
			Если ПараметрыЗаполнения.СоздаватьВКлючи Тогда
				КлючАналитики = ЗначениеКлючаАналитики(Выборка);
			Иначе
				ТекстИсключения = НСтр("ru = 'Ошибка при заполнении ключей в коллекции: есть аналитики, по которым ключи еще не созданы.'");
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.КлючиАналитикиПланированияСтруктуры,
					,
					ТекстИсключения);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		Иначе
			КлючАналитики = Выборка.АналитикаПланированияСтруктуры;
		КонецЕсли;
		
		ПараметрыЗаполнения.ИзмененаАналитика = Истина;
		Если НЕ ПараметрыЗаполнения.ЗаполнятьКлючВКоллекции Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДополнитьКлюч Тогда
			Коллекция[Выборка.Индекс][ИменаПолей.ЗаполняемаяАналитикаПланированияСтруктуры] = КлючАналитики;
		Иначе
			Коллекция[Выборка.Индекс][ИменаПолей.АналитикаПланированияСтруктуры] = КлючАналитики;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики планирования структуры.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля должно браться из имени ключа.
//		секция идентификации {ЦФО, Проект, Организация},
//			все ключи заданы.
//
Функция ИменаПолейКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("ЦФО", "ЦФО");
	ИменаПолей.Вставить("Проект", "Проект");
	ИменаПолей.Вставить("Организация", "Организация");
	ИменаПолей.Вставить("АналитикаПланированияСтруктуры", "АналитикаПланированияСтруктуры");
	
	Возврат ИменаПолей;
КонецФункции

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики планирования структуры.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//
Функция ИменаПолейДополненияКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("АналитикаПланированияСтруктуры", "АналитикаПланированияСтруктуры");
	ИменаПолей.Вставить("ЗаполняемаяАналитикаПланированияСтруктуры", "АналитикаПланированияСтруктуры");
	ИменаПолей.Вставить("ЦФО", "");
	ИменаПолей.Вставить("Проект", "");
	ИменаПолей.Вставить("Организация", "");
	
	Возврат ИменаПолей;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция ПолучитьНаборЗаписей(ПараметрыАналитики)
	
	// В параметрах аналитики могут быть не все свойства
	СтруктураАналитики = Новый Структура("ЦФО, Проект, Организация");
	ЗаполнитьЗначенияСвойств(СтруктураАналитики, ПараметрыАналитики);
	Если НЕ ЗначениеЗаполнено(СтруктураАналитики.ЦФО)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Проект)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.Организация) Тогда
		Возврат Неопределено
	Иначе
		НаборЗаписей = РегистрыСведений.АналитикаПланированияСтруктуры.СоздатьНаборЗаписей();
		
		Для Каждого КлючЗначение Из СтруктураАналитики Цикл
			НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
		КонецЦикла;
		
		НоваяСтрока = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураАналитики, "ЦФО, Проект, Организация");
		ПроверитьЗаполнениеПоляСтруктуры(НоваяСтрока);
		Возврат НаборЗаписей;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьЗаполнениеПоляСтруктуры(МенеджерЗаписиАналитикаПланированияСтруктуры)

	Если НЕ ЗначениеЗаполнено(МенеджерЗаписиАналитикаПланированияСтруктуры.ЦФО)
		И НЕ ЗначениеЗаполнено(МенеджерЗаписиАналитикаПланированияСтруктуры.Проект)
		И НЕ ЗначениеЗаполнено(МенеджерЗаписиАналитикаПланированияСтруктуры.Организация) Тогда
		ВызватьИсключение НСтр("ru = 'Должно быть заполнено одно из значений параметров ""ЦФО"", ""Проект"" или ""Организация""'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеКлючейАналитикиВКоллекции

Функция ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Коллекция.НомерСтроки - 1 КАК Индекс,
		|	&ПолеАналитикаПланирования КАК АналитикаПланированияСтруктуры,
		|	&ПолеЦФО КАК ЦФО,
		|	&ПолеПроект КАК Проект,
		|	&ПолеОрганизация КАК Организация
		|
		|ПОМЕСТИТЬ Коллекция
		|ИЗ &Коллекция КАК Коллекция;
		|
		|ВЫБРАТЬ
		|	Коллекция.Индекс,
		|	Аналитика.КлючАналитики КАК АналитикаПланированияСтруктуры,
		|	Коллекция.ЦФО,
		|	Коллекция.Проект,
		|	Коллекция.Организация
		|ИЗ
		|	Коллекция КАК Коллекция
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияСтруктуры КАК Аналитика
		|		ПО Аналитика.ЦФО = Коллекция.ЦФО
		|		И Аналитика.Проект = Коллекция.Проект
		|		И Аналитика.Организация = Коллекция.Организация
		|ГДЕ
		|	Аналитика.КлючАналитики ЕСТЬ NULL
		|	ИЛИ Аналитика.КлючАналитики <> Коллекция.АналитикаПланированияСтруктуры
		|	ИЛИ Аналитика.КлючАналитики = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияСтруктуры.ПустаяСсылка)
		|";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитикаПланирования", "Коллекция." + ИменаПолей.АналитикаПланированияСтруктуры);
	
	// Поле ЦФО может отсутствовать в таблице.
	Если ЗначениеЗаполнено(ИменаПолей.ЦФО) Тогда
		Если ТипЗнч(ИменаПолей.ЦФО) = Тип("Структура") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеЦФО", ИменаПолей.ЦФО.ТекстПоля);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеЦФО", "Коллекция." + ИменаПолей.ЦФО);
		КонецЕсли;  
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеЦФО", "ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)");
	КонецЕсли; 
	
	// Поле Организация может отсутствовать в таблице.
	Если ЗначениеЗаполнено(ИменаПолей.Организация) Тогда
		Если ТипЗнч(ИменаПолей.Организация) = Тип("Структура") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеОрганизация", ИменаПолей.Организация.ТекстПоля);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеОрганизация", "Коллекция." + ИменаПолей.Организация);
		КонецЕсли;  
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеОрганизация", "ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)");
	КонецЕсли; 
	
	// Поле Проект может отсутствовать в таблице.
	Если ЗначениеЗаполнено(ИменаПолей.Проект) Тогда
		Если ТипЗнч(ИменаПолей.Проект) = Тип("Структура") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПроект", ИменаПолей.Проект.ТекстПоля);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПроект", "Коллекция." + ИменаПолей.Проект);
		КонецЕсли;  
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПроект", "ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)");
	КонецЕсли; 
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Коллекция.НомерСтроки - 1 КАК Индекс,
		|	&ПолеАналитика            КАК АналитикаПланированияСтруктуры,
		|	&ПолеПриемник             КАК АналитикаПланированияСтруктурыПриемник,
		|	&ПолеЦФО				  КАК ЦФО,
		|	&ПолеПроект				  КАК Проект,
		|	&ПолеОрганизация		  КАК Организация
		|ПОМЕСТИТЬ ВтКоллекция
		|ИЗ &Коллекция КАК Коллекция
		|;
		|ВЫБРАТЬ
		|	Коллекция.Индекс                       КАК Индекс,
		|	Коллекция.АналитикаПланированияСтруктуры КАК АналитикаПланированияСтруктуры,
		|	Коллекция.АналитикаПланированияСтруктурыПриемник КАК АналитикаПланированияСтруктурыПриемник,
		|	ВЫБОР КОГДА Коллекция.ЦФО = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		ТОГДА ЕСТЬNULL(Аналитика.ЦФО, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|		ИНАЧЕ Коллекция.ЦФО
		|	КОНЕЦ                                КАК ЦФО,
		|	ВЫБОР КОГДА Коллекция.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|		ТОГДА ЕСТЬNULL(Аналитика.Проект, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))
		|		ИНАЧЕ Коллекция.Проект
		|	КОНЕЦ                                КАК Проект,
		|	ВЫБОР КОГДА Коллекция.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|		ТОГДА ЕСТЬNULL(Аналитика.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|		ИНАЧЕ Коллекция.Организация
		|	КОНЕЦ                                КАК Организация
		|ПОМЕСТИТЬ Коллекция
		|ИЗ
		|	ВтКоллекция КАК Коллекция
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияСтруктуры КАК Аналитика
		|	ПО Коллекция.АналитикаПланированияСтруктуры = Аналитика.КлючАналитики
		|;
		|ВЫБРАТЬ
		|	Коллекция.Индекс КАК Индекс,
		|	Ключи.КлючАналитики КАК АналитикаПланированияСтруктуры,
		|	Коллекция.ЦФО КАК ЦФО,
		|	Коллекция.Проект КАК Проект,
		|	Коллекция.Организация КАК Организация
		|ИЗ
		|	Коллекция КАК Коллекция
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаПланированияСтруктуры КАК Ключи
		|	ПО Ключи.ЦФО = Коллекция.ЦФО
		|		И Ключи.Проект = Коллекция.Проект
		|		И Ключи.Организация = Коллекция.Организация
		|ГДЕ
		|	Ключи.КлючАналитики ЕСТЬ NULL
		|	ИЛИ Ключи.КлючАналитики <> Коллекция.АналитикаПланированияСтруктуры
		|	ИЛИ Коллекция.АналитикаПланированияСтруктурыПриемник = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПланированияСтруктуры.ПустаяСсылка)
		|";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика", "Коллекция." + ИменаПолей.АналитикаПланированияСтруктуры);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриемник", "Коллекция." + ИменаПолей.ЗаполняемаяАналитикаПланированияСтруктуры);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеЦФО", ?(ЗначениеЗаполнено(ИменаПолей.ЦФО),"Коллекция." + ИменаПолей.ЦФО, "ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПроект", ?(ЗначениеЗаполнено(ИменаПолей.Проект),"Коллекция." + ИменаПолей.Проект, "ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеОрганизация", ?(ЗначениеЗаполнено(ИменаПолей.Организация),"Коллекция." + ИменаПолей.Организация, "ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)"));
	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
